lambda/src/test/resources/DigiSubs2023/annual/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "ACCOUNT-NAME",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "ACCOUNT-NAME",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 2,
  "revision" : "2.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2022-11-01",
  "serviceActivationDate" : "2022-11-01",
  "customerAcceptanceDate" : "2022-11-17",
  "subscriptionStartDate" : "2022-11-01",
  "subscriptionEndDate" : "2024-11-01",
  "lastBookingDate" : "2023-11-01",
  "termStartDate" : "2023-11-01",
  "termEndDate" : "2024-11-01",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 9.92,
  "totalContractedValue" : 232.88,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : "f4d76fec-a56b-aa98-0000-000000004086",
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : "ANNUAL-INTRO-GLOBAL",
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "DeliveryAgent__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : "Direct",
  "ActivationDate__c" : "2023-01-02T18:04:27.412489",
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : "ANNUAL-INTRO-GLOBAL",
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a128ab58b7f7f47018b89a3dd763cfc",
    "productId" : "2c92a0ff5345f9200153559c6d2a3385",
    "productName" : "Discounts",
    "productSku" : "ABC-00000012",
    "productRatePlanId" : "2c92a0ff5345f9220153559d915d5c26",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Percentage",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a128ab58b7f7f47018b89a3dd793d01",
      "originalChargeId" : "8a128ed8841c577d0184352ef2c557fa",
      "productRatePlanChargeId" : "2c92a0fd5345efa10153559e97bb76c6",
      "number" : "C-04065126",
      "name" : "Percentage",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "DiscountPercentage",
      "uom" : null,
      "version" : 2,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : "ONETIMERECURRINGUSAGE",
      "discountLevel" : "subscription",
      "discountClass" : null,
      "billingDay" : "DefaultFromCustomer",
      "listPriceBase" : null,
      "specificListPriceBase" : null,
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : null,
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : null,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2022-11-17",
      "effectiveEndDate" : "2023-11-17",
      "processedThroughDate" : "2022-11-17",
      "chargedThroughDate" : "2022-12-17",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Fixed_Period",
      "upToPeriodsType" : "Months",
      "upToPeriods" : 12,
      "specificEndDate" : null,
      "mrr" : 0.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 0.000000000,
      "dtcv" : 0.000000000,
      "originalOrderDate" : "2022-11-01",
      "amendedByOrderOn" : "2023-11-01",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "16.81%  discount",
      "price" : null,
      "discountAmount" : null,
      "discountPercentage" : 16.810000000
    } ]
  }, {
    "id" : "8a128ab58b7f7f47018b89a3dd7c3d04",
    "productId" : "2c92a0fb4edd70c8014edeaa4ddb21e7",
    "productName" : "Digital Pack",
    "productSku" : "ABC-00000005",
    "productRatePlanId" : "2c92a0fb4edd70c8014edeaa4e972204",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Digital Pack Annual",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a128ab58b7f7f47018b89a3dd7e3d06",
      "originalChargeId" : "8a128ed8841c577d0184352ef2e457ff",
      "productRatePlanChargeId" : "2c92a0fb4edd70c9014edeaa5001218c",
      "number" : "C-04065127",
      "name" : "Digital Pack Annual",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 2,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToTermStart",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2022-11-17",
      "effectiveEndDate" : "2024-11-01",
      "processedThroughDate" : "2022-11-17",
      "chargedThroughDate" : "2023-11-17",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 9.916666667,
      "dmrc" : 0.000000000,
      "tcv" : 232.881720433,
      "dtcv" : 119.000000000,
      "originalOrderDate" : "2022-11-01",
      "amendedByOrderOn" : "2023-11-01",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP119",
      "price" : 119.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  } ],
  "orderNumber" : "O-01571595",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2022-11-01",
    "endDate" : "2024-11-01",
    "status" : "Active"
  }, {
    "startDate" : "2024-11-01",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}