lambda/src/test/resources/DigiSubs2023/discounted/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "ACCOUNT-NAME",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "ACCOUNT-NAME",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 1,
  "revision" : "1.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2023-10-03",
  "serviceActivationDate" : "2023-10-03",
  "customerAcceptanceDate" : "2023-10-19",
  "subscriptionStartDate" : "2023-10-03",
  "subscriptionEndDate" : "2024-10-03",
  "lastBookingDate" : "2023-10-03",
  "termStartDate" : "2023-10-03",
  "termEndDate" : "2024-10-03",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 12.42,
  "totalContractedValue" : 142.38,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : "5fa091db-5c62-2b04-0000-000000002db4",
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : "DLESNCWON",
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "DeliveryAgent__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : "Direct",
  "ActivationDate__c" : "2023-10-04T11:04:40.235841",
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : "DLESNCWON",
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a12894e8ae6c727018af5114b873daa",
    "productId" : "2c92a0ff5345f9200153559c6d2a3385",
    "productName" : "Discounts",
    "productSku" : "ABC-00000012",
    "productRatePlanId" : "2c92a0ff5345f9220153559d915d5c26",
    "productRatePlanNumber" : "PRP-00000048",
    "ratePlanName" : "Percentage",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : "SRP-04645297",
    "ratePlanCharges" : [ {
      "id" : "8a12894e8ae6c727018af5114b913dab",
      "originalChargeId" : "8a12894e8ae6c727018af5114b913dab",
      "productRatePlanChargeId" : "2c92a0fd5345efa10153559e97bb76c6",
      "number" : "C-04655063",
      "name" : "Percentage",
      "productRatePlanChargeNumber" : "PRPC-00000044",
      "type" : "Recurring",
      "model" : "DiscountPercentage",
      "uom" : null,
      "version" : 1,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : "ONETIMERECURRINGUSAGE",
      "discountLevel" : "subscription",
      "discountClass" : null,
      "billingDay" : "DefaultFromCustomer",
      "listPriceBase" : null,
      "specificListPriceBase" : null,
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : null,
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : null,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-10-19",
      "effectiveEndDate" : "2024-10-03",
      "processedThroughDate" : null,
      "chargedThroughDate" : null,
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Fixed_Period",
      "upToPeriodsType" : "Months",
      "upToPeriods" : 12,
      "specificEndDate" : null,
      "mrr" : 0.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 0.000000000,
      "dtcv" : 0.000000000,
      "originalOrderDate" : "2023-10-03",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "35%  discount",
      "price" : null,
      "discountAmount" : null,
      "discountPercentage" : 35.000000000
    } ]
  }, {
    "id" : "8a12894e8ae6c727018af5114ba93daf",
    "productId" : "2c92a0fb4edd70c8014edeaa4ddb21e7",
    "productName" : "Digital Pack",
    "productSku" : "ABC-00000005",
    "productRatePlanId" : "2c92a0fb4edd70c8014edeaa4e972204",
    "productRatePlanNumber" : "PRP-00000021",
    "ratePlanName" : "Digital Pack Annual",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : "SRP-04645298",
    "ratePlanCharges" : [ {
      "id" : "8a12894e8ae6c727018af5114bb13db0",
      "originalChargeId" : "8a12894e8ae6c727018af5114bb13db0",
      "productRatePlanChargeId" : "2c92a0fb4edd70c9014edeaa5001218c",
      "number" : "C-04655064",
      "name" : "Digital Pack Annual",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 1,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToTermStart",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-10-19",
      "effectiveEndDate" : "2024-10-03",
      "processedThroughDate" : null,
      "chargedThroughDate" : null,
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 12.416666667,
      "dmrc" : 12.416666667,
      "tcv" : 142.377777782,
      "dtcv" : 142.377777782,
      "originalOrderDate" : "2023-10-03",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP149",
      "price" : 149.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  } ],
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2023-10-03",
    "endDate" : "2024-10-03",
    "status" : "Active"
  }, {
    "startDate" : "2024-10-03",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}