lambda/src/test/resources/DigiSubs2023/quarterly/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "ACCOUNT-NUMBER",
  "subscriptionNumber" : "ACCOUNT-NUMBER",
  "version" : 8,
  "revision" : "8.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2014-09-10",
  "serviceActivationDate" : "2014-09-10",
  "customerAcceptanceDate" : "2016-05-10",
  "subscriptionStartDate" : "2016-05-10",
  "subscriptionEndDate" : "2024-05-10",
  "lastBookingDate" : "2023-05-10",
  "termStartDate" : "2023-05-10",
  "termEndDate" : "2024-05-10",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 11.98,
  "totalContractedValue" : 1150.40,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : null,
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "DeliveryAgent__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : null,
  "ActivationDate__c" : "2016-06-23T02:15:27.729Z",
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : "DGA01",
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a128bc887fb31e501880408ec0e77de",
    "productId" : "2c92a0fb4edd70c8014edeaa4ddb21e7",
    "productName" : "Digital Pack",
    "productSku" : "ABC-00000005",
    "productRatePlanId" : "2c92a0fb4edd70c8014edeaa4e8521fe",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Digital Pack Quarterly",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a128bc887fb31e501880408ec1077e0",
      "originalChargeId" : "2c92a0fd555283b101555adb6f3a2e6d",
      "productRatePlanChargeId" : "2c92a0fb4edd70c9014edeaa4fd42186",
      "number" : "C-00266638",
      "name" : "Digital Pack Quarterly",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 8,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Quarter",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToTermStart",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2016-05-10",
      "effectiveEndDate" : "2024-05-10",
      "processedThroughDate" : "2023-08-10",
      "chargedThroughDate" : "2023-11-10",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 11.983333333,
      "dmrc" : 0.000000000,
      "tcv" : 1150.400000000,
      "dtcv" : 143.800000000,
      "originalOrderDate" : "2016-06-16",
      "amendedByOrderOn" : "2023-05-10",
      "description" : "Migrated sub",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP35.95",
      "price" : 35.950000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  } ],
  "orderNumber" : "O-00621564",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2016-05-10",
    "endDate" : "2024-05-10",
    "status" : "Active"
  }, {
    "startDate" : "2024-05-10",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}