lambda/src/test/resources/Migrations/SupporterPlus2024/annual/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "ACCOUNT-NAME",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "ACCOUNT-NAME",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 6,
  "revision" : "6.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2022-11-11",
  "serviceActivationDate" : "2022-11-11",
  "customerAcceptanceDate" : "2022-11-11",
  "subscriptionStartDate" : "2022-11-11",
  "subscriptionEndDate" : "2024-11-11",
  "lastBookingDate" : "2023-12-01",
  "termStartDate" : "2023-11-11",
  "termEndDate" : "2024-11-11",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "currency" : "AUD",
  "contractedMrr" : 41.67,
  "totalContractedValue" : 1000.00,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : "cd0ca593-02bf-4f9a-0000-00000000bff6",
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "DeliveryAgent__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : "Direct",
  "ActivationDate__c" : null,
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : null,
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : {
    "country" : "Australia"
  },
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a12820a8c0ff963018c2504b9b75b25",
    "lastChangeType" : "Remove",
    "productId" : "8a12865b8219d9b4018221061563643f",
    "productName" : "Supporter Plus",
    "productSku" : "ABC-00000032",
    "productRatePlanId" : "8a128ed885fc6ded01860228f77e3d5a",
    "productRatePlanNumber" : "PRP-00000179",
    "ratePlanName" : "Supporter Plus V2 - Annual",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : "SRP-04663641",
    "ratePlanCharges" : [ {
      "id" : "8a12820a8c0ff963018c2504b9bd5b27",
      "originalChargeId" : "8a1289ba8b0e5d8a018b133f99fc234d",
      "productRatePlanChargeId" : "8a128ed885fc6ded01860228f7cb3d5f",
      "number" : "C-04674417",
      "name" : "Supporter Plus Annual Charge",
      "productRatePlanChargeNumber" : "PRPC-00000279",
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 3,
      "subscriptionChargeDeliverySchedule" : null,
      "numberOfDeliveries" : null,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "AUD",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "applyToBillingPeriodPartially" : false,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "reflectDiscountInNetAmount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-11-11",
      "effectiveEndDate" : "2023-11-11",
      "processedThroughDate" : "2023-11-11",
      "chargedThroughDate" : "2023-11-11",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 13.333333333,
      "dmrc" : 0.000000000,
      "tcv" : 0.000000000,
      "dtcv" : -150.000000000,
      "originalOrderDate" : "2023-10-09",
      "amendedByOrderOn" : "2023-12-01",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "salesPrice" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "AUD160",
      "price" : 150.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a12820a8c0ff963018c2504b9b75b26",
      "originalChargeId" : "8a1289ba8b0e5d8a018b133f99fc234c",
      "productRatePlanChargeId" : "8a12892d85fc6df4018602451322287f",
      "number" : "C-04674416",
      "name" : "Contribution",
      "productRatePlanChargeNumber" : "PRPC-00000282",
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 3,
      "subscriptionChargeDeliverySchedule" : null,
      "numberOfDeliveries" : null,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "AUD",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "applyToBillingPeriodPartially" : false,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "reflectDiscountInNetAmount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-11-11",
      "effectiveEndDate" : "2023-11-11",
      "processedThroughDate" : "2023-11-11",
      "chargedThroughDate" : "2023-11-11",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 0.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 0.000000000,
      "dtcv" : 0.000000000,
      "originalOrderDate" : "2023-10-09",
      "amendedByOrderOn" : "2023-12-01",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "salesPrice" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "AUD0",
      "price" : 0.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  }, {
    "id" : "8a12820a8c0ff963018c2504ba045b2f",
    "lastChangeType" : "Add",
    "productId" : "8a12865b8219d9b4018221061563643f",
    "productName" : "Supporter Plus",
    "productSku" : "ABC-00000032",
    "productRatePlanId" : "8a128ed885fc6ded01860228f77e3d5a",
    "productRatePlanNumber" : "PRP-00000179",
    "ratePlanName" : "Supporter Plus V2 - Annual",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : "SRP-04803254",
    "ratePlanCharges" : [ {
      "id" : "8a12820a8c0ff963018c2504ba065b33",
      "originalChargeId" : "8a1280478bdd42cb018c0c8b4f6179a2",
      "productRatePlanChargeId" : "8a128ed885fc6ded01860228f7cb3d5f",
      "number" : "C-04819663",
      "name" : "Supporter Plus Annual Charge",
      "productRatePlanChargeNumber" : "PRPC-00000279",
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 1,
      "subscriptionChargeDeliverySchedule" : null,
      "numberOfDeliveries" : null,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "AUD",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "applyToBillingPeriodPartially" : false,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "reflectDiscountInNetAmount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-11-11",
      "effectiveEndDate" : "2024-11-11",
      "processedThroughDate" : "2023-11-11",
      "chargedThroughDate" : "2024-11-11",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 13.333333333,
      "dmrc" : 13.333333333,
      "tcv" : 150.000000000,
      "dtcv" : 150.000000000,
      "originalOrderDate" : "2023-11-26",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "salesPrice" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "AUD160",
      "price" : 150.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a12820a8c0ff963018c2504ba065b31",
      "originalChargeId" : "8a1280478bdd42cb018c0c8b4f6179a1",
      "productRatePlanChargeId" : "8a12892d85fc6df4018602451322287f",
      "number" : "C-04819662",
      "name" : "Contribution",
      "productRatePlanChargeNumber" : "PRPC-00000282",
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 1,
      "subscriptionChargeDeliverySchedule" : null,
      "numberOfDeliveries" : null,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "AUD",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "applyToBillingPeriodPartially" : false,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "reflectDiscountInNetAmount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-11-11",
      "effectiveEndDate" : "2024-11-11",
      "processedThroughDate" : "2023-11-11",
      "chargedThroughDate" : "2024-11-11",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 28.333333333,
      "dmrc" : 28.333333333,
      "tcv" : 340.000000000,
      "dtcv" : 340.000000000,
      "originalOrderDate" : "2023-11-26",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "salesPrice" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "AUD340",
      "price" : 340.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  }, {
    "id" : "8a12820a8c0ff963018c2504ba095b37",
    "lastChangeType" : "Remove",
    "productId" : "8a12865b8219d9b4018221061563643f",
    "productName" : "Supporter Plus",
    "productSku" : "ABC-00000032",
    "productRatePlanId" : "8a12865b8219d9b40182210618a464ba",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Supporter Plus Annual",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : "SRP-04074986",
    "ratePlanCharges" : [ {
      "id" : "8a12820a8c0ff963018c2504ba0b5b39",
      "originalChargeId" : "8a129f6f8461c6ef018465e6d1e9118a",
      "productRatePlanChargeId" : "8a12865b8219d9b40182210618c664c1",
      "number" : "C-04074986",
      "name" : "Supporter Plus Annual Charge",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 1,
      "subscriptionChargeDeliverySchedule" : null,
      "numberOfDeliveries" : null,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "AUD",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "applyToBillingPeriodPartially" : false,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToTermStart",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "reflectDiscountInNetAmount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2022-11-11",
      "effectiveEndDate" : "2023-11-11",
      "processedThroughDate" : "2023-11-11",
      "chargedThroughDate" : "2023-11-11",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 41.666666667,
      "dmrc" : 41.666666667,
      "tcv" : 500.000000000,
      "dtcv" : 500.000000000,
      "originalOrderDate" : "2022-11-11",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "salesPrice" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "AUD500",
      "price" : 500.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  } ],
  "orderNumber" : "O-01761068",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2022-11-11",
    "endDate" : "2024-11-11",
    "status" : "Active"
  }, {
    "startDate" : "2024-11-11",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ],
  "invoiceGroupNumber" : null,
  "createTime" : "2023-12-01 10:55:15",
  "updateTime" : "2023-12-01 15:00:21"
}