lambda/src/test/resources/SupporterPlus2023V1V2/annual/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "0010J00001gz4tmQAA",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "0010J00001gz4tmQAA",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 1,
  "revision" : "1.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2023-07-02",
  "serviceActivationDate" : "2023-07-02",
  "customerAcceptanceDate" : "2023-07-02",
  "subscriptionStartDate" : "2023-07-02",
  "subscriptionEndDate" : "2024-07-02",
  "lastBookingDate" : "2023-07-02",
  "termStartDate" : "2023-07-02",
  "termEndDate" : "2024-07-02",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 10.00,
  "totalContractedValue" : 120.00,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : "f37f1a11-4fd0-1e38-0000-00000004eabd",
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : "Direct",
  "ActivationDate__c" : null,
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : null,
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a128432890171d1018914866bee0e7f",
    "productId" : "8a12865b8219d9b4018221061563643f",
    "productName" : "Supporter Plus",
    "productSku" : "ABC-00000032",
    "productRatePlanId" : "8a12865b8219d9b40182210618a464ba",
    "ratePlanName" : "Supporter Plus Annual",
    "ratePlanCharges" : [ {
      "id" : "8a128432890171d1018914866bf70e80",
      "originalChargeId" : "8a128432890171d1018914866bf70e80",
      "productRatePlanChargeId" : "8a12865b8219d9b40182210618c664c1",
      "number" : "C-04417974",
      "name" : "Supporter Plus Annual Charge",
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 1,
      "pricingSummary" : "USD120",
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "USD",
      "price" : 120.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToTermStart",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-07-02",
      "effectiveEndDate" : "2024-07-02",
      "processedThroughDate" : "2023-07-02",
      "chargedThroughDate" : "2024-07-02",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.000000000,
      "dmrc" : 10.000000000,
      "tcv" : 120.000000000,
      "dtcv" : 120.000000000,
      "originalOrderDate" : "2023-07-02",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    } ],
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null
  } ],
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2023-07-02",
    "endDate" : "2024-07-02",
    "status" : "Active"
  }, {
    "startDate" : "2024-07-02",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}